refactor npl-loader
